Revit 2026 API

# ColorFillSchemeEntrySetElementIdValue Method

---

Sets new ElementId value of entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetElementIdValue(
	ElementId value
)
```
```vb
Public Sub SetElementIdValue (
	value As ElementId
)
```
```cpp
public:
void SetElementIdValue(
	ElementId^ value
)
```
```fsharp
member SetElementIdValue :
        value : ElementId -> unit
```

#### Parameters

value ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The entry has different storage type with ElementId. |

You should only use this method if the StorageType property reports the type of the entry as a ElementId.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace